{
  "text": "MongoDB, Inc. Announces Third Quarter Fiscal 2025 Financial Results\nDecember 9, 2024\nThird Quarter Fiscal 2025 Total Revenue of $529.4 million, up 22% Year-over-Year\nContinued Strong Customer Growth with Over 52,600 Customers as of October 31, 2024\nMongoDB Atlas Revenue up 26% Year-over-Year; 68% of Total Q3 Revenue\nNEW YORK, Dec. 9, 2024 /PRNewswire/ -- MongoDB, Inc. (NASDAQ: MDB) today announced its financial results for the third quarter ended October\n31, 2024.\n \n  \n\"MongoDB's third quarter results were significantly ahead of expectations on the top and bottom line, driven by better-than-expected EA performance\nand 26% Atlas revenue growth.  We continue to see success winning new business due to the superiority of MongoDB's developer data platform in\naddressing a wide variety of mission-critical use cases,\" said Dev Ittycheria, President and Chief Executive Officer of MongoDB.\n\"We continue to invest in our legacy app modernization and AI offerings as our document model and distributed architecture are exceptionally well\nsuited for customers looking to build highly-performant, modern applications.  MongoDB is in a great position to be a central pillar of the emerging AI\ntech stack and benefit from the next wave of application development in the years ahead.\"\nThird Quarter Fiscal 2025 Financial Highlights\nRevenue: Total revenue was $529.4 million for the third quarter of fiscal 2025, an increase of 22% year-over-year.\nSubscription revenue was $512.2 million, an increase of 22% year-over-year, and services revenue was $17.2 million, an\nincrease of 18% year-over-year.\nGross Profit: Gross profit was $394.0 million for the third quarter of fiscal 2025, representing a 74% gross margin\ncompared to 75% in the year-ago period. Non-GAAP gross profit was $405.7 million, representing a 77% non-GAAP gross\nmargin, consistent with a non-GAAP gross margin of 77% in the year-ago period.\nLoss from Operations: Loss from operations was $27.9 million for the third quarter of fiscal 2025, compared to a loss\nfrom operations of $45.2 million in the year-ago period. Non-GAAP income from operations was $101.5 million, compared\nto non-GAAP income from operations of $78.5 million in the year-ago period.\nNet Loss: Net loss was $9.8 million, or $0.13 per share, based on 74.0 million weighted-average shares outstanding, for\nthe third quarter of fiscal 2025. This compares to a net loss of $29.3 million, or $0.41 per share, in the year-ago period.\nNon-GAAP net income was $98.1 million, or $1.16 per share, based on 84.2 million diluted weighted-average shares\noutstanding. This compares to a non-GAAP net income of $79.1 million, or $0.96 per share, in the year-ago period.\nCash Flow: As of October 31, 2024, MongoDB had $2.3 billion in cash, cash equivalents, short-term investments and\nrestricted cash. During the three months ended October 31, 2024, MongoDB generated $37.4 million of cash in operations,\nused $2.0 million of cash in capital expenditures and used $0.9 million of cash in principal repayments of finance leases,\nleading to free cash flow of $34.6 million, compared to free cash flow of $35.0 million in the year-ago period.\nA reconciliation of each non-GAAP measure to the most directly comparable GAAP measure has been provided in the financial statement tables\nincluded at the end of this press release. An explanation of these measures is also included below under the heading \"Non-GAAP Financial\nMeasures.\"\nThird Quarter Fiscal 2025 and Recent Business Highlights\nMongoDB announced the general availability of MongoDB 8.0, the best-performing version of MongoDB. With more than\n45 architectural enhancements and new features like vector quantization in MongoDB Atlas Vector Search, MongoDB 8.0\nprovides significant performance improvements, reduced costs, and additional scalability, resilience, and data security\ncapabilities.\nMongoDB continues to expand its partnerships with the major cloud providers. At Amazon Web Services' (AWS) re:Invent\nconference, MongoDB was named AWS's Technology Partner of the Year for North America. MongoDB also announced\n\nthat it obtained the AWS Modernization Competency designation and launched a MongoDB University course focused on\nbuilding AI applications with MongoDB and AWS. At Microsoft Ignite, MongoDB announced new technology integrations for\nAI, data analytics, and automating database deployments across on-premises, cloud, and edge environments.\nLaunched in July 2024, the MongoDB AI Applications Program (MAAP) is designed to help companies unleash the power\nof their data and to take advantage of rapidly advancing AI technologies. We recently announced that Capgemini,\nConfluent, IBM, Unstructured, and QuantumBlack, AI by McKinsey have joined the MAAP ecosystem, offering customers\nadditional integration and solution options.\nExecutive Leadership Update\nMichael Gordon, MongoDB's Chief Operating Officer and Chief Financial Officer, will be stepping down at the end of the Company's fiscal year on\nJanuary 31, 2025, and afterwards will serve as an advisor to ensure a smooth transition. The Company has commenced an executive search process\nfor a new CFO and will evaluate internal and external candidates.  Serge Tanjga, MongoDB's Senior Vice President of Finance, will serve as interim\nCFO starting February 1st if a permanent successor has not been named by that date.\nDev Ittycheria commented, \"On behalf of everyone at MongoDB, I want to thank Michael for everything he has done to contribute to our success in his\nnearly 10 years with the company.  In Michael's time here, MongoDB had a successful IPO, has grown revenue nearly 50x and has successfully\nscaled the business model to generate meaningful operating leverage. Michael has also built out a world-class finance team that I am confident will\ndeliver a smooth transition to a new CFO in the coming months.\"\nMichael Gordon said, \"I am incredibly proud of what we have accomplished as a team in my almost ten years with the company.  While we have\nachieved much success to date, I strongly believe MongoDB is still in the early stages of realizing its full potential as it continues to expand its share in\none of the largest markets in software. I'd like to thank Dev for our tremendous partnership this past decade.\"\nFourth Quarter and Full Year Fiscal 2025 Guidance\nBased on information available to management as of today, December 9, 2024, MongoDB is issuing the following financial guidance for the fourth\nquarter and full year fiscal 2025.\nFourth Quarter Fiscal 2025\nFull Year Fiscal 2025\nRevenue\n$515.0 million to $519.0 million $1.973 billion to $1.977 billion\nNon-GAAP Income from Operations\n$55.0 million to $58.0 million\n$241.8 million to $244.8 million\nNon-GAAP Net Income per Share\n$0.62 to $0.65\n$3.01 to $3.03\nReconciliations of non-GAAP income from operations and non-GAAP net income per share guidance to the most directly comparable GAAP\nmeasures are not available without unreasonable efforts on a forward-looking basis due to the high variability, complexity and low visibility with respect\nto the charges excluded from these non-GAAP measures; in particular, the measures and effects of stock-based compensation expense specific to\nequity compensation awards that are directly impacted by unpredictable fluctuations in MongoDB's stock price. MongoDB expects the variability of the\nabove charges to have a significant, and potentially unpredictable, impact on its future GAAP financial results.\nConference Call Information\nMongoDB will host a conference call today, December 9, 2024, at 5:00 p.m. (Eastern Time) to discuss its financial results and business outlook. A live\nwebcast of the call will be available on the \"Investor Relations\" page of MongoDB's website at https://investors.mongodb.com. To access the call by\nphone, please go to this link (registration link), and you will be provided with dial in details. To avoid delays, we encourage participants to dial into the\nconference call fifteen minutes ahead of the scheduled start time. A replay of the webcast will also be available for a limited time at\nhttp://investors.mongodb.com.\nForward-Looking Statements\nThis press release includes certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, or the\nSecurities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements concerning MongoDB's financial guidance\nfor the fourth fiscal quarter and full year fiscal 2025. These forward-looking statements include, but are not limited to, plans, objectives, expectations\nand intentions and other statements contained in this press release that are not historical facts and statements identified by words such as \"anticipate,\"\n\"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"will,\" \"would\" or the negative or plural of these words or similar\nexpressions or variations. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and\nprospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans,\nintentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no\nassurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from\nthose described in the forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our\ncontrol including, without limitation: our customers renewing their subscriptions with us and expanding their usage of software and related services; the\neffects of the ongoing military conflicts between Russia and Ukraine and Israel and Hamas on our business and future operating results; economic\ndownturns and/or the effects of rising interest rates, inflation and volatility in the global economy and financial markets on our business and future\noperating results; our potential failure to meet publicly announced guidance or other expectations about our business and future operating results; our\nlimited operating history; our history of losses; failure of our platform to satisfy customer demands; the effects of increased competition; our\ninvestments in new products and our ability to introduce new features, services or enhancements; our ability to effectively expand our sales and\nmarketing organization; our ability to continue to build and maintain credibility with the developer community; our ability to add new customers or\nincrease sales to our existing customers; our ability to maintain, protect, enforce and enhance our intellectual property; the effects of social, ethical and\nregulatory issues relating to the use of new and evolving technologies, such as artificial intelligence, in our offerings or partnerships; the growth and\nexpansion of the market for database products and our ability to penetrate that market; our ability to integrate acquired businesses and technologies\nsuccessfully or achieve the expected benefits of such acquisitions; our ability to maintain the security of our software and adequately address privacy\nconcerns; our ability to manage our growth effectively and successfully recruit and retain additional highly-qualified personnel; and the price volatility of\n\nour common stock. These and other risks and uncertainties are more fully described in our filings with the Securities and Exchange Commission\n(\"SEC\"), including under the caption \"Risk Factors\" in our Quarterly Report on Form 10-Q for the quarter ended July 31, 2024, filed with the SEC on\nAugust 30, 2024. Additional information will be made available in our Quarterly Report on Form 10-Q for the quarter ended October 31, 2024, and\nother filings and reports that we may file from time to time with the SEC. Except as required by law, we undertake no duty or obligation to update any\nforward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.\nNon-GAAP Financial Measures\nThis press release includes the following financial measures defined as non-GAAP financial measures by the SEC: non-GAAP gross profit, non-GAAP\ngross margin, non-GAAP operating expenses, non-GAAP income from operations, non-GAAP operating margin, non-GAAP net income, non-GAAP\nnet income per share and free cash flow. Non-GAAP gross profit and non-GAAP gross margin exclude expenses associated with stock-based\ncompensation. Non-GAAP operating expenses, non-GAAP income from operations, non-GAAP operating margin, non-GAAP net income and\nnon-GAAP net income per share exclude:\nexpenses associated with stock-based compensation including employer payroll taxes upon the vesting and exercising of\nstock-based awards and expenses related to stock appreciation rights previously issued to our employees in China;\namortization of intangible assets for the acquired technology and acquired customer relationships associated with prior\nacquisitions; and\nin the case of non-GAAP net income and non-GAAP net income per share, amortization of the debt issuance costs\nassociated with our convertible senior notes and gains or losses on our financial instruments;\nadditionally, non-GAAP net income and non-GAAP net income per share are adjusted for an assumed provision for income\ntaxes based on an estimated long-term non-GAAP tax rate. The non-GAAP tax rate was calculated utilizing a three-year\nfinancial projection that excludes the direct impact of the GAAP to non-GAAP adjustments and considers other factors\nsuch as operating structure and existing tax positions in various jurisdictions. We intend to periodically reevaluate the\nprojected long-term tax rate, as necessary, for significant events and our ongoing analysis of relevant tax law changes.\nMongoDB uses these non-GAAP financial measures internally in analyzing its financial results and believes they are useful to investors, as a\nsupplement to GAAP measures, in evaluating MongoDB's ongoing operational performance. MongoDB believes that the use of these non-GAAP\nfinancial measures provides an additional tool for investors to use in evaluating ongoing operating results and trends and in comparing its financial\nresults with other companies in MongoDB's industry, many of which may present similar non-GAAP financial measures to investors.\nFree cash flow represents net cash from/used in operating activities, less capital expenditures, principal repayments of finance lease liabilities and\ncapitalized software development costs, if any. MongoDB uses free cash flow to understand and evaluate its liquidity and to generate future operating\nplans. The exclusion of capital expenditures, principal repayments of finance lease liabilities and amounts capitalized for software development\nfacilitates comparisons of MongoDB's liquidity on a period-to-period basis and excludes items that it does not consider to be indicative of its liquidity.\nMongoDB believes that free cash flow is a measure of liquidity that provides useful information to investors in understanding and evaluating the\nstrength of its liquidity and future ability to generate cash that can be used for strategic opportunities or investing in its business in the same manner as\nMongoDB's management and board of directors.\nNon-GAAP financial measures have limitations as an analytical tool and should not be considered in isolation from, or as a substitute for, financial\ninformation prepared in accordance with GAAP. In particular, other companies may report non-GAAP gross profit, non-GAAP gross margin, non-GAAP\noperating expenses, non-GAAP income from operations, non-GAAP net income, non-GAAP net income per share, free cash flow or similarly titled\nmeasures but calculate them differently, which reduces their usefulness as comparative measures. Investors are encouraged to review the\nreconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures, as presented below. This earnings\npress release and any future releases containing such non-GAAP reconciliations can also be found on the Investor Relations page of MongoDB's\nwebsite at https://investors.mongodb.com.\nAbout MongoDB\nHeadquartered in New York, MongoDB's mission is to empower innovators to create, transform, and disrupt industries by unleashing the power of\nsoftware and data. Built by developers, for developers, MongoDB's developer data platform is a database with an integrated set of related services\nthat allow development teams to address the growing requirements for today's wide variety of modern applications, all in a unified and consistent user\nexperience. MongoDB has tens of thousands of customers in over 100 countries. The MongoDB database platform has been downloaded hundreds of\nmillions of times since 2007, and there have been millions of builders trained through MongoDB University courses. To learn more, visit mongodb.com.\nInvestor Relations\nBrian Denyeau\nICR for MongoDB\n646-277-1251\nir@mongodb.com\nMedia Relations\nMongoDB\npress@mongodb.com\n \nMONGODB, INC. \nCONDENSED CONSOLIDATED BALANCE SHEETS\n(in thousands of U.S. dollars, except share and per share data)\n(unaudited)\n\nOctober 31, 2024 January 31, 2024\nAssets\nCurrent assets:\nCash and cash equivalents  \n$           673,054\n$           802,959\nShort-term investments\n1,629,038\n1,212,448\nAccounts receivable, net of allowance for doubtful accounts of $8,212 and $8,054 as of October 31, 2024\nand January 31, 2024, respectively \n334,629\n325,610\nDeferred commissions  \n103,715\n92,512\nPrepaid expenses and other current assets  \n53,827\n50,107\nTotal current assets  \n2,794,263\n2,483,636\nProperty and equipment, net  \n47,345\n53,042\nOperating lease right-of-use assets\n35,859\n37,365\nGoodwill  \n69,679\n69,679\nAcquired intangible assets, net\n963\n3,957\nDeferred tax assets  \n5,575\n4,116\nOther assets  \n271,101\n217,847\nTotal assets  \n$        3,224,785\n$        2,869,642\nLiabilities and Stockholders' Equity\nCurrent liabilities:\nAccounts payable  \n$             11,444\n$               9,905\nAccrued compensation and benefits  \n120,598\n112,579\nOperating lease liabilities\n10,787\n9,797\nOther accrued liabilities  \n86,795\n74,831\nDeferred revenue  \n286,431\n357,108\nConvertible senior notes, net  \n1,124,720\n—\nTotal current liabilities  \n1,640,775\n564,220\nDeferred tax liability\n1,030\n285\nOperating lease liabilities\n27,639\n30,918\nDeferred revenue\n18,481\n20,296\nConvertible senior notes, net\n—\n1,143,273\nOther liabilities\n34,884\n41,661\nTotal liabilities  \n1,722,809\n1,800,653\nStockholders' equity:\nCommon stock, par value of $0.001 per share; 1,000,000,000 shares authorized as of October 31, 2024 and\n  January 31, 2024; 74,493,146 shares issued and 74,393,775 shares outstanding as of October 31, 2024;\n  72,840,692 shares issued and 72,741,321 shares outstanding as of January 31, 2024\n73\n73\nAdditional paid-in capital  \n3,357,146\n2,777,322\nTreasury stock, 99,371 shares (repurchased at an average of $13.27 per share) as of October 31, 2024 and\n  January 31, 2024\n(1,319)\n(1,319)\nAccumulated other comprehensive income\n2,606\n4,545\nAccumulated deficit  \n(1,856,530)\n(1,711,632)\nTotal stockholders' equity\n1,501,976\n1,068,989\nTotal liabilities and stockholders' equity\n$        3,224,785\n$        2,869,642\n \nMONGODB, INC. \nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands of U.S. dollars, except share and per share data)\n(unaudited)\nThree Months Ended October\n31,\nNine Months Ended October 31,\n2024\n2023\n2024\n2023\nRevenue:\nSubscription  \n$         512,205\n$         418,339\n$      1,412,906\n$      1,182,387\nServices  \n17,170\n14,599\n45,139\n42,622\nTotal revenue  \n529,375\n432,938\n1,458,045\n1,225,009\nCost of revenue:\nSubscription(1)\n111,150\n87,954\n318,728\n250,949\nServices(1)\n24,181\n19,104\n67,553\n58,895\nTotal cost of revenue  \n135,331\n107,058\n386,281\n309,844\n\nGross profit  \n394,044\n325,880\n1,071,764\n915,165\nOperating expenses:\nSales and marketing(1)   \n217,954\n192,977\n658,937\n571,644\nResearch and development(1)   \n151,410\n128,150\n446,437\n370,387\nGeneral and administrative(1)   \n52,556\n49,969\n163,892\n135,900\nTotal operating expenses  \n421,920\n371,096\n1,269,266\n1,077,931\nLoss from operations  \n(27,876)\n(45,216)\n(197,502)\n(162,766)\nOther income, net  \n20,767\n19,554\n61,749\n51,336\nLoss before provision for income taxes  \n(7,109)\n(25,662)\n(135,753)\n(111,430)\nProvision for income taxes  \n2,667\n3,635\n9,145\n9,710\nNet loss  \n$            (9,776)\n$          (29,297)\n$       (144,898)\n$       (121,140)\nNet loss per share, basic and diluted  \n$              (0.13)\n$              (0.41)\n$              (1.97)\n$              (1.71)\nWeighted-average shares used to compute net loss per share, basic and\ndiluted\n74,020,593\n71,560,023\n73,472,900\n70,878,162\n       (1) Includes stock‑based compensation expense as follows:\nThree Months Ended October\n31,\nNine Months Ended October 31,\n2024\n2023\n2024\n2023\nCost of revenue—subscription  \n$                7,884 $                6,018 $               21,566 $               17,607\nCost of revenue—services  \n3,495\n3,200\n10,151\n9,490\nSales and marketing  \n40,540\n40,585\n121,193\n118,567\nResearch and development  \n57,850\n50,759\n168,211\n143,238\nGeneral and administrative  \n15,943\n15,267\n47,777\n44,194\nTotal stock‑based compensation expense  \n$             125,712 $             115,829\n$            \n368,898\n$            \n333,096\n \nMONGODB, INC. \nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands of U.S. dollars)\n(unaudited)\nThree Months Ended October\n31,\nNine Months Ended October\n31,\n2024\n2023\n2024\n2023\nCash flows from operating activities\nNet loss  \n$           (9,776)\n$         (29,297) $       (144,898)\n$       (121,140)\nAdjustments to reconcile net loss to net cash provided by operating activities:\nDepreciation and amortization  \n2,405\n4,711\n9,580\n13,257\nStock-based compensation  \n125,712\n115,829\n368,898\n333,096\nAmortization of debt discount and issuance costs\n715\n849\n2,419\n2,543\nAmortization of finance right-of-use assets\n994\n994\n2,981\n2,981\nAmortization of operating right-of-use assets\n3,229\n2,302\n8,300\n6,781\nDeferred income taxes  \n(825)\n(195)\n(799)\n(572)\nAmortization of premium and accretion of discount on short-term investments,\nnet\n(5,656)\n(10,896)\n(19,117)\n(36,405)\nRealized and unrealized gain on financial instruments, net\n(338)\n—\n(1,190)\n(1,294)\nUnrealized foreign exchange loss (gain)\n788\n(1,621)\n1,992\n(322)\nChange in operating assets and liabilities:\nAccounts receivable, net\n(24,557)\n(397)\n(11,258)\n11,761\nPrepaid expenses and other current assets  \n(1,964)\n3,485\n(582)\n700\nDeferred commissions  \n(18,821)\n(12,720)\n(38,794)\n(17,160)\nOther long-term assets  \n(8,395)\n(77)\n(17,704)\n(215)\nAccounts payable  \n1,370\n1,434\n1,569\n1,078\nAccrued liabilities  \n(6,719)\n16,855\n22,494\n20,314\nOperating lease liabilities\n(3,777)\n(2,333)\n(9,145)\n(6,989)\nDeferred revenue  \n(17,039)\n(47,374)\n(71,352)\n(138,724)\nOther liabilities, non-current\n92\n(3,127)\n(3,741)\n(2,840)\nNet cash provided by operating activities  \n37,438\n38,422\n99,653\n66,850\n\nCash flows from investing activities\nPurchases of property and equipment  \n(1,981)\n(2,078)\n(3,571)\n(3,336)\nInvestments in non-marketable securities\n(250)\n—\n(5,750)\n(2,056)\nBusiness combinations, net of cash acquired\n—\n(15,000)\n—\n(15,000)\nProceeds from maturities of marketable securities  \n135,000\n435,000\n570,000\n1,190,000\nPurchases of marketable securities  \n(786,170)\n(583,252)\n(971,803)\n(1,233,851)\nNet cash used in investing activities  \n(653,401)\n(165,330)\n(411,124)\n(64,243)\nCash flows from financing activities\nProceeds from settlement of capped calls\n—\n—\n170,589\n—\nProceeds from the issuance of common stock under the Employee Stock\nPurchase Plan\n—\n—\n18,640\n19,781\nProceeds from exercise of stock options\n315\n1,303\n1,621\n4,812\nPrincipal payments of finance leases\n(895)\n(1,380)\n(4,534)\n(4,083)\nNet cash (used in) provided by financing activities  \n(580)\n(77)\n186,316\n20,510\nEffect of exchange rate changes on cash, cash equivalents and restricted cash  \n(274)\n(2,513)\n(2,825)\n(1,098)\nNet (decrease) increase in cash, cash equivalents and restricted cash  \n(616,817)\n(129,498)\n(127,980)\n22,019\nCash, cash equivalents and restricted cash, beginning of period  \n1,292,480\n607,856\n803,643\n456,339\nCash, cash equivalents and restricted cash, end of period  \n$         675,663\n$         478,358\n$         675,663\n$         478,358\n \nMONGODB, INC. \nRECONCILIATION OF GAAP MEASURES TO NON-GAAP MEASURES\n(in thousands of U.S. dollars, except share and per share data)\n(unaudited)\nThree Months Ended\nOctober 31,\nNine Months Ended\nOctober 31,\n2024\n2023\n2024\n2023\nReconciliation of GAAP gross profit to non-GAAP gross profit:\nGross profit on a GAAP basis\n$      394,044\n$      325,880\n$   1,071,764\n$      915,165\n  Gross margin (Gross profit/Total revenue) on a GAAP basis\n74 %\n75 %\n74 %\n75 %\nAdd back:\n  Expenses associated with stock-based compensation: Cost of Revenue—Subscription\n7,999\n6,201\n22,145\n18,252\n  Expenses associated with stock-based compensation: Cost of Revenue—Services\n3,639\n3,194\n10,393\n10,734\nNon-GAAP gross profit\n$      405,682\n$      335,275\n$   1,104,302\n$      944,151\n  Non-GAAP gross margin (Non-GAAP gross profit/Total revenue)\n77 %\n77 %\n76 %\n77 %\nReconciliation of GAAP operating expenses to non-GAAP operating expenses:\nSales and marketing operating expense on a GAAP basis\n$      217,954\n$      192,977\n$      658,937\n$      571,644\nLess:\n  Expenses associated with stock-based compensation\n42,155\n42,349\n125,129\n130,638\n  Amortization of intangible assets\n—\n760\n85\n2,280\nNon-GAAP sales and marketing operating expense\n$      175,799\n$      149,868\n$      533,723\n$      438,726\nResearch and development operating expense on a GAAP basis\n$      151,410\n$      128,150\n$      446,437\n$      370,387\nLess:\n  Expenses associated with stock-based compensation\n59,017\n52,133\n173,166\n148,679\n  Amortization of intangible assets\n170\n2,052\n2,908\n5,122\nNon-GAAP research and development operating expense\n$        92,223\n$        73,965\n$      270,363\n$      216,586\nGeneral and administrative operating expense on a GAAP basis\n$        52,556\n$        49,969\n$      163,892\n$      135,900\nLess:\n  Expenses associated with stock-based compensation\n16,377\n17,024\n50,469\n48,329\nNon-GAAP general and administrative operating expense\n$        36,179\n$        32,945\n$      113,423\n$        87,571\nReconciliation of GAAP loss from operations to non-GAAP income from\noperations:\nLoss from operations on a GAAP basis\n$      (27,876)\n$      (45,216)\n$    (197,502)\n$    (162,766)\n  GAAP operating margin (Loss from operations/Total revenue)\n(5) %\n(10) %\n(14) %\n(13) %\nAdd back:\n  Expenses associated with stock-based compensation\n129,186\n120,901\n381,303\n356,632\n\n  Amortization of intangible assets\n170\n2,812\n2,993\n7,402\nNon-GAAP income from operations\n$      101,480\n$        78,497\n$      186,794\n$      201,268\n  Non-GAAP operating margin (Non-GAAP Income from operations/Total revenue)\n19 %\n18 %\n13 %\n16 %\nReconciliation of GAAP net loss to non-GAAP net income:\nNet loss on a GAAP basis\n$        (9,776)\n$      (29,297)\n$    (144,898)\n$    (121,140)\nAdd back:\n  Expenses associated with stock-based compensation\n129,186\n120,901\n381,303\n356,632\n  Amortization of intangible assets\n170\n2,812\n2,993\n7,402\n  Amortization of debt issuance costs related to convertible senior notes\n716\n849\n2,419\n2,543\nLess:\n  Gains on financial instruments, net\n338\n—\n1,190\n1,294\n  Income tax effects and adjustments *\n21,858\n16,145\n40,809\n41,061\nNon-GAAP net income\n$        98,100\n$        79,120\n$      199,818\n$      203,082\nReconciliation of GAAP net loss per share, basic and diluted, to non-GAAP net\nincome per share, basic and diluted:\nNet loss per share, basic and diluted, on a GAAP basis\n$          (0.13)\n$          (0.41)\n$          (1.97)\n$          (1.71)\nAdd back:\n  Expenses associated with stock-based compensation\n1.75\n1.69\n5.19\n5.03\n  Amortization of intangible assets\n—\n0.04\n0.04\n0.10\n  Amortization of debt issuance costs related to convertible senior notes\n0.01\n0.01\n0.03\n0.04\nLess:\n  Gains on financial instruments, net\n—\n—\n0.02\n0.02\n  Income tax effects and adjustments *\n0.30\n0.23\n0.56\n0.58\nNon-GAAP net income per share, basic\n$            1.33\n$            1.10\n$            2.71\n$            2.86\nAdjustment for fully diluted earnings per share\n(0.17)\n(0.14)\n(0.32)\n(0.39)\nNon-GAAP net income per share, diluted **\n$            1.16\n$            0.96\n$            2.39\n$            2.47\n* Non-GAAP financial information is adjusted for an assumed provision for income taxes based on our long-term projected tax rate of 20%. Due to the\ndifferences in the tax treatment of items excluded from non-GAAP earnings, our estimated tax rate on non-GAAP income may differ from our GAAP\ntax rate and from our actual tax liabilities.\n** Diluted non-GAAP net income per share is calculated based upon 84.2 million and 83.7 million of diluted weighted-average shares of outstanding\ncommon stock for the three and nine months ended October 31, 2024, respectively, and 82.7 million and 82.2 million of diluted weighted-average\nshares of outstanding common stock for the three and nine months ended October 31, 2023, respectively.\n \nThe following table presents a reconciliation of free cash flow to net cash provided by operating activities, the most directly comparable GAAP\nmeasure, for each of the periods indicated (unaudited, in thousands):\nThree Months Ended October 31,\nNine Months Ended October 31,\n2024\n2023\n2024\n2023\nNet cash provided by operating activities  \n$           37,438\n$          38,422\n$           99,653\n$           66,850\nCapital expenditures  \n(1,981)\n(2,078)\n(3,571)\n(3,336)\nPrincipal repayments of finance leases\n(895)\n(1,380)\n(4,534)\n(4,083)\nCapitalized software \n—\n—\n—\n—\nFree cash flow  \n$           34,562\n$          34,964\n$           91,548\n$           59,431\n \nMONGODB, INC. \nCUSTOMER COUNT METRICS\nThe following table presents certain customer count information as of the periods indicated:\n10/31/2022 1/31/2023 4/30/2023 7/31/2023 10/31/2023 1/31/2024 4/30/2024 7/31/2024 10/31/2024\nTotal Customers (a)\n39,100+\n40,800+\n43,100+\n45,000+\n46,400+\n47,800+\n49,200+\n50,700+\n52,600+\nDirect Sales Customers(b)\n5,900+\n6,400+\n6,700+\n6,800+\n6,900+\n7,000+\n7,100+\n7,300+\n7,400+\nMongoDB Atlas Customers\n37,600+\n39,300+\n41,600+\n43,500+\n44,900+\n46,300+\n47,700+\n49,200+\n51,100+\nCustomers over $100K(c)\n1,545\n1,651\n1,761\n1,855\n1,972\n2,052\n2,137\n2,189\n2,314\n\n(a) Our definition of \"customer\" excludes users of our free offerings and all affiliated entities are counted as a single customer.\n(b) Direct Sales Customers are customers that were sold through our direct sales force and channel partners.\n(c) Represents the number of customers with $100,000 or greater in annualized recurring revenue (\"ARR\") and annualized monthly recurring revenue\n(\"MRR\"). ARR includes the revenue we expect to receive from our customers over the following 12 months based on contractual commitments and, in\nthe case of Direct Sales Customers of MongoDB Atlas, by annualizing the prior 90 days of their actual consumption of MongoDB Atlas, assuming no\nincreases or reductions in their subscriptions or usage. For all other customers of our self-serve products, we calculate annualized MRR by\nannualizing the prior 30 days of their actual consumption of such products, assuming no increases or reductions in usage. ARR and annualized MRR\nexclude professional services.\n \nMONGODB, INC. \nSUPPLEMENTAL REVENUE INFORMATION\nThe following table presents certain supplemental revenue information as of the periods indicated:\n10/31/2022 1/31/2023 4/30/2023 7/31/2023 10/31/2023 1/31/2024 4/30/2024 7/31/2024 10/31/2024\nMongoDB Enterprise Advanced: % of\nSubscription Revenue\n29 %\n28 %\n28 %\n26 %\n27 %\n26 %\n25 %\n24 %\n25 %\nDirect Sales Customers(a)\n Revenue: % of Subscription Revenue\n87 %\n88 %\n88 %\n88 %\n88 %\n88 %\n87 %\n87 %\n88 %\n(a) Direct Sales Customers are customers that were sold through our direct sales force and channel partners.\n \n View original content to download multimedia:https://www.prnewswire.com/news-releases/mongodb-inc-announces-third-quarter-fiscal-\n2025-financial-results-302326649.html\nSOURCE MongoDB, Inc.\n",
  "metadata": {
    "filename": "a.pdf",
    "file_type": "pdf",
    "file_size": 147189
  }
}